# FamilyParameterSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameterSet Constructor
FamilyParameterSet Class See Also
---
Initializes a new instance of the FamilyParameterSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyParameterSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FamilyParameterSet()
```

# See Also
FamilyParameterSet Class
Autodesk.Revit.DB Namespace